app/views/users/show.html.erb

SELECT COUNT(*) FROM "gossips" WHERE "gossips"."user_id" = $1  [["user_id", 112]]
---
    <li class="list-group-item">Habite à <%= @user.city.name %></li>
    <li class="list-group-item">Il a publié <%= @user.gossips.count %> gossip(s)</li>