app/views/gossips/index.html.erb

          <% end %>
        <span><i class="far fa-comment ml-2"></i> <%= gossip.comments.count %></span>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 248]]