app/views/gossips/index.html.erb

        <p class="text-secondary"><%= gossip.content %></p>
        <p class="text-muted fw-light"><a href="<%= user_path(gossip.user_id) %>"><%= gossip.user.first_name %> <%= gossip.user.last_name %></a> l'a comméré il y a <span class="text-secondary fw-bold"><%= time_ago_in_words(gossip.created_at) %></span></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]

      <div class="text-muted small text-center align-self-center">
        <span><i class="far fa-comment ml-2"></i> <%= gossip.comments.count %> commentaire<%= "s" if gossip.comments.count > 1%></span>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 248]]