app/views/gossips/show.html.erb

  <div class="card-header">
    <%= @gossip.user.first_name %> <%= @gossip.user.last_name %> <br />
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 112], ["LIMIT", 1]]

    <ul>
      <% @gossip.comments.each do |comment| %>
        <li class="card-text"><%= comment.user.first_name %> <%= comment.user.last_name %> : <%= comment.content %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 210]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 144], ["LIMIT", 1]]