app/controllers/comments_controller.rb

  def create
    @comment = Comment.create!(content: params[:content], gossip: Gossip.find(params[:gossip_id]), user: current_user)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 214], ["LIMIT", 1]]