app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "gossip_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "com"], ["gossip_id", 214], ["user_id", 144], ["created_at", "2021-11-03 14:53:48.655155"], ["updated_at", "2021-11-03 14:53:48.655155"]]
SELECT  "users".* FROM "users" WHERE "users"."first_name" = $1 LIMIT $2  [["first_name", "anonymous"], ["LIMIT", 1]]
---
  def create
    @comment = Comment.create!(content: params[:content], gossip: Gossip.find(params[:gossip_id]), user: User.find_by(first_name: "anonymous"))

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 116], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 218], ["LIMIT", 1]]
---
  def edit
    @comment = Comment.find(params[:id])
    @gossip = Gossip.find(params[:gossip_id])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 116], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 73], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 218], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 136], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1, "user_id" = $2, "updated_at" = $3 WHERE "comments"."id" = $4  [["content", "nouveau\r\n"], ["user_id", 141], ["updated_at", "2021-11-03 14:50:13.549965"], ["id", 116]]
---
  def update
    @comment = Comment.find(params[:id])
    if @comment.update!(content: params[:comment][:content], gossip: Gossip.find(params[:gossip_id]), user: @comment.user)