app/controllers/gossips_controller.rb

  def index
    @all_gossips = Gossip.all
    @user = User.all
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]