app/controllers/gossips_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def index
    @all_gossips = Gossip.all

SELECT  "users".* FROM "users" WHERE "users"."first_name" = $1 LIMIT $2  [["first_name", "anonymous"], ["LIMIT", 1]]
INSERT INTO "gossips" ("title", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "fgdgh"], ["content", "gdfgqe"], ["created_at", "2021-11-02 17:04:25.507940"], ["updated_at", "2021-11-02 17:04:25.507940"], ["user_id", 112]]
---
  def create
    @gossip = Gossip.new(title: params[:title], content: params[:content], user: User.find_by(first_name: "anonymous")) # avec xxx qui sont les données obtenues à partir du formulaire
    if @gossip.save # essaie de sauvegarder en base @gossip

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 162], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "gossips"."id" = $4  [["title", "sqfdsgdfg"], ["content", "reqstrytfdyg"], ["updated_at", "2021-11-03 08:30:07.739948"], ["id", 167]]
---
  def update
    @gossip = Gossip.find(params[:id])
    @gossip.update()